w7d2/MusicApp/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
  def new
    @album = Album.new
    @id = params[:id]
    @bands = Band.all