w6d3&4/routes_controllers_demo/app/controllers/artwork_shares_controller.rb

  def destroy
    artwork_share = ArtworkShare.destroy(params[:id])
---
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]