w6d3&4/routes_controllers_demo/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "likeable_id", "likeable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likeable_id", 2], ["likeable_type", "Comment"], ["created_at", "2022-02-03 22:35:05.082666"], ["updated_at", "2022-02-03 22:35:05.082666"]]
---
  def create
    like = Like.new(like_params)

    if like.save

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 7]]
---
  def destroy
    like = Like.destroy(params[:id])