w6d3&4/routes_controllers_demo/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (users.username LIKE '%'davinci'%' )
SELECT "users".* FROM "users"
---
  def index # render plain: "I'm in the index action!" htt:localhost:3000
    if params[:username]
      username = params[:username]
      users = User.where("users.username LIKE ? ", "%#{username}%")
      render json: users
    else
      users = User.all

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Jill"], ["email", "jill@gmail.com"], ["updated_at", "2022-02-03 00:30:05.875040"], ["id", 2]]
---
  def update
    user = User.update(params[:id], user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    user = User.destroy(params[:id])