w5d4/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "t"], ["LIMIT", 1]]
---
  def self.random_code
    check = true
    while check
      result = SecureRandom.base64(16)
      check = ShortenedUrl.exists?(short_url: check)

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_url", "OKBx3B9E8o/9iMo8GjvrlQ=="], ["long_url", "facebook.com"], ["user_id", 2], ["created_at", "2022-01-28 00:22:41.445714"], ["updated_at", "2022-01-28 00:22:41.445714"]]
---
  def self.shortened_url_factory(user, long_url)
    short = ShortenedUrl.random_code
    ShortenedUrl.create!(user_id: user.id, long_url: long_url, short_url: short)