w6d5/cats99/app/controllers/cats_controller.rb

  def show
    @cat = Cat.find_by(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE (1) LIMIT $1  [["LIMIT", 1]]