w7d5/reddit_clone/app/controllers/posts_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @post = Post.new
    @sub = Sub.find_by(id: params[:sub_id])

INSERT INTO "posts" ("title", "url", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "fake post"], ["url", ""], ["sub_id", 1], ["author_id", 2], ["created_at", "2022-02-11 23:34:54.065007"], ["updated_at", "2022-02-11 23:34:54.065007"]]
---
  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id
    if @post.save