w7d5/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @sub = Sub.new(sub_params)
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Spikeball"], ["description", "this is the subreddit for spikeball, super cool. Subscribe to join in on the fun\r\n\r\n"], ["updated_at", "2022-02-11 22:53:48.229945"], ["id", 1]]
---
  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def is_moderator
    @sub = Sub.find_by(id: params[:id])